Revit 2026 API

# BRepBuilderPersistentIds Class

---

This class stores a map from ExternalGeometryIds to BRepBuilderGeometryIds.

SystemObject Autodesk.Revit.DBBRepBuilderPersistentIds

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BRepBuilderPersistentIds : IDisposable
```
```vb
Public Class BRepBuilderPersistentIds
	Implements IDisposable
```
```cpp
public ref class BRepBuilderPersistentIds : IDisposable
```
```fsharp
type BRepBuilderPersistentIds =
    class
        interface IDisposable
    end
```

The BRepBuilderPersistentIds type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BRepBuilderPersistentIds | Constructs a new BRepBuilderPersistentIds and associates the existing BRepBuilder to it. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddSubTag | Adds a correspondence between an ExternalGeometryId and a BRepBuilderGeometryId. Note that an existing correspondence in the map cannot be updated and that a particular BRepBuilderGeometryId may be related to at most one ExternalGeometryId. |
|  | Dispose | Releases all resources used by the BRepBuilderPersistentIds |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsAssociatedBRepBuilderValid | Validates the associated (in the constructor) BRepBuilder for this BRepBuilderPersistentIds. |
|  | IsBRepBuilderGeometryIdFaceOrEdge | Validates the input BRepBuilderGeometryId that will be used to create a correspondence. In order to be valid, the input BRepBuilderGeometryId must represent the ID of either a Face or an Edge. |
|  | IsValidBRepBuilderGeometryIdForNewCorrespondence | Validates the input BRepBuilderGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input BRepBuilderGeometryId must not already exist. |
|  | IsValidExternalGeometryIdForNewCorrespondence | Validates the input ExternalGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input ExternalGeometryId must not already exist. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace